{
  "model_type": "olmo_hybrid",
  "architectures": [
    "OlmoHybridForCausalLM"
  ],
  "vocab_size": 100352,
  "hidden_size": 3840,
  "intermediate_size": 11008,
  "num_hidden_layers": 32,
  "num_attention_heads": 30,
  "num_key_value_heads": 30,
  "hidden_act": "silu",
  "max_position_embeddings": 65536,
  "initializer_range": 0.02,
  "use_cache": true,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": false,
  "layer_types": [
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention"
  ],
  "linear_num_key_heads": 30,
  "linear_num_value_heads": 30,
  "linear_key_head_dim": 96,
  "linear_value_head_dim": 192,
  "linear_conv_kernel_dim": 4,
  "linear_allow_neg_eigval": true,
  "pad_token_id": 100277,
  "bos_token_id": null,
  "eos_token_id": 100257,
  "transformers_version": "4.52.0",
  "rope_parameters": null
}
