{
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "decoder_start_token_id": 1,
  "encoder_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "frame_ms": 5.0,
    "head_dim": 64,
    "hidden_act": "gelu",
    "hidden_size": 768,
    "intermediate_size": 3072,
    "max_position_embeddings": 4096,
    "model_type": "moonshine_streaming_encoder",
    "num_attention_heads": 10,
    "num_hidden_layers": 14,
    "num_key_value_heads": 10,
    "sample_rate": 16000,
    "sliding_windows": [
      [
        16,
        4
      ],
      [
        16,
        4
      ],
      [
        16,
        0
      ],
      [
        16,
        0
      ],
      [
        16,
        0
      ],
      [
        16,
        0
      ],
      [
        16,
        0
      ],
      [
        16,
        0
      ],
      [
        16,
        0
      ],
      [
        16,
        0
      ],
      [
        16,
        0
      ],
      [
        16,
        0
      ],
      [
        16,
        4
      ],
      [
        16,
        4
      ]
    ]
  },
  "encoder_hidden_size": 768,
  "eos_token_id": 2,
  "ffn_mult": 4,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 640,
  "intermediate_size": 2560,
  "is_encoder_decoder": true,
  "max_position_embeddings": 4096,
  "model_type": "moonshine_streaming",
  "num_attention_heads": 10,
  "num_hidden_layers": 14,
  "num_key_value_heads": 10,
  "pad_head_dim_to_multiple_of": null,
  "pad_token_id": 0,
  "rope_parameters": {
    "partial_rotary_factor": 0.5,
    "rope_theta": 10000.0,
    "rope_type": "default"
  },
  "tie_word_embeddings": false,
  "transformers_version": "5.0.0.dev0",
  "use_cache": true,
  "vocab_size": 32768
}
